#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
      + extra_config             = {
          + "claim"          = "display_name"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "display_name"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidbasic"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "display_name"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.onestopauth.keycloak_custom_identity_provider_mapper.bceidboth_bceid_userid will be created
  + resource "keycloak_custom_identity_provider_mapper" "bceidboth_bceid_userid" {
      + extra_config             = {
          + "claim"          = "bceid_userid"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "bceid_userid"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidboth"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "bceid_userid"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.onestopauth.keycloak_custom_identity_provider_mapper.bceidboth_displayname will be created
  + resource "keycloak_custom_identity_provider_mapper" "bceidboth_displayname" {
      + extra_config             = {
          + "claim"          = "display_name"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "display_name"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidboth"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "display_name"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.onestopauth.keycloak_custom_identity_provider_mapper.bceidbusiness_bceid_userid will be created
  + resource "keycloak_custom_identity_provider_mapper" "bceidbusiness_bceid_userid" {
      + extra_config             = {
          + "claim"          = "bceid_userid"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "bceid_userid"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidbusiness"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "bceid_userid"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.onestopauth.keycloak_custom_identity_provider_mapper.bceidbusiness_displayname will be created
  + resource "keycloak_custom_identity_provider_mapper" "bceidbusiness_displayname" {
      + extra_config             = {
          + "claim"          = "display_name"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "display_name"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "bceidbusiness"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "display_name"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.onestopauth.keycloak_custom_identity_provider_mapper.idir_displayname will be created
  + resource "keycloak_custom_identity_provider_mapper" "idir_displayname" {
      + extra_config             = {
          + "claim"          = "display_name"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "display_name"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "idir"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "display_name"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.onestopauth.keycloak_custom_identity_provider_mapper.idir_idir_guid will be created
  + resource "keycloak_custom_identity_provider_mapper" "idir_idir_guid" {
      + extra_config             = {
          + "claim"          = "idir_guid"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "idir_guid"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "idir"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "idir_guid"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.onestopauth.keycloak_custom_identity_provider_mapper.idir_idir_userid will be created
  + resource "keycloak_custom_identity_provider_mapper" "idir_idir_userid" {
      + extra_config             = {
          + "claim"          = "idir_userid"
          + "syncMode"       = "INHERIT"
          + "user.attribute" = "idir_userid"
        }
      + id                       = (known after apply)
      + identity_provider_alias  = "idir"
      + identity_provider_mapper = "oidc-user-attribute-idp-mapper"
      + name                     = "idir_userid"
      + realm                    = (known after apply)
    }

  # module.keycloak_dev.module.onestopauth.keycloak_oidc_identity_provider.azureidir will be created
  + resource "keycloak_oidc_identity_provider" "azureidir" {
      + accepts_prompt_none_forward_from_client = false
      + add_read_token_role_on_create           = false
      + alias                                   = "azureidir"
      + authenticate_by_default                 = false
      + authorization_url                       = "https://sso-keycloak-c6af30-dev.apps.gold.devops.gov.bc.ca/auth/realms/azureidir/protocol/openid-connect/auth"
      + backchannel_supported                   = true
      + client_id                               = "onestopauth"
      + client_secret                           = (sensitive value)
      + default_scopes                          = "openid"
      + disable_user_info                       = false
      + display_name                            = "azureidir"
      + enabled                                 = true
      + extra_config                            = {
          + "clientAuthMethod" = "client_secret_post"
        }
      + first_broker_login_flow_alias           = "first broker login"
      + hide_on_login_page                      = false
      + id                                      = (known after apply)
      + internal_id                             = (known after apply)
      + jwks_url                                = "https://sso-keycloak-c6af30-dev.apps.gold.devops.gov.bc.ca/auth/realms/azureidir/protocol/openid-connect/certs"
      + link_only                               = false
      + provider_id                             = "oidc"
      + realm                                   = (known after apply)
      + store_token                             = true
      + token_url                               = "https://sso-keycloak-c6af30-dev.apps.gold.devops.gov.bc.ca/auth/realms/azureidir/protocol/openid-connect/token"
      + trust_email                             = false
      + ui_locales                              = false
      + user_info_url                           = "https://sso-keycloak-c6af30-dev.apps.gold.devops.gov.bc.ca/auth/realms/azureidir/protocol/openid-connect/userinfo"
      + validate_signature                      = true
    }

  # module.keycloak_dev.module.onestopauth.keycloak_oidc_identity_provider.bceidbasic will be created
  + resource "keycloak_oidc_identity_provider" "bceidbasic" {
      + accepts_prompt_none_forward_from_client = false
      + add_read_token_role_on_create           = false
      + alias                                   = "bceidbasic"
      + authenticate_by_default                 = false
      + authorization_url                       = "https://sso-keycloak-c6af30-dev.apps.gold.devops.gov.bc.ca/auth/realms/bceidbasic/protocol/openid-connect/auth"
      + backchannel_supported                   = true
      + client_id                               = "onestopauth"
      + client_secret                           = (sensitive value)
      + default_scopes                          = "openid"
      + disable_user_info                       = false
      + display_name                            = "bceidbasic"
      + enabled                                 = true
      + extra_config                            = {
          + "clientAuthMethod" = "client_secret_post"
        }
      + first_broker_login_flow_alias           = "first broker login"
      + hide_on_login_page                      = false
      + id                                      = (known after apply)
      + internal_id                             = (known after apply)
      + jwks_url                                = "https://sso-keycloak-c6af30-dev.apps.gold.devops.gov.bc.ca/auth/realms/bceidbasic/protocol/openid-connect/certs"
      + link_only                               = false
      + provider_id                             = "oidc"
      + realm                                   = (known after apply)
      + store_token                             = true
      + token_url                               = "https://sso-keycloak-c6af30-dev.apps.gold.devops.gov.bc.ca/auth/realms/bceidbasic/protocol/openid-connect/token"
      + trust_email                             = false
      + ui_locales                              = false
      + user_info_url                           = "https://sso-keycloak-c6af30-dev.apps.gold.devops.gov.bc.ca/auth/realms/bceidbasic/protocol/openid-connect/userinfo"
      + validate_signature                      = true
    }

  # module.keycloak_dev.module.onestopauth.keycloak_oidc_identity_provider.bceidboth will be created
  + resource "keycloak_oidc_identity_provider" "bceidboth" {
      + accepts_prompt_none_forward_from_client = false
      + add_read_token_role_on_create           = false
      + alias                                   = "bceidboth"
      + authenticate_by_default                 = false
      + authorization_url                       = "https://sso-keycloak-c6af30-dev.apps.gold.devops.gov.bc.ca/auth/realms/bceidboth/protocol/openid-connect/auth"
      + backchannel_supported                   = true
      + client_id                               = "onestopauth"
      + client_secret                           = (sensitive value)
      + default_scopes                          = "openid"
      + disable_user_info                       = false
      + display_name                            = "bceidboth"
      + enabled                                 = true
      + extra_config                            = {
          + "clientAuthMethod" = "client_secret_post"
        }
      + first_broker_login_flow_alias           = "first broker login"
      + hide_on_login_page                      = false
      + id                                      = (known after apply)
      + internal_id                             = (known after apply)
      + jwks_url                                = "https://sso-keycloak-c6af30-dev.apps.gold.devops.gov.bc.ca/auth/realms/bceidboth/protocol/openid-connect/certs"
      + link_only                               = false
      + provider_id                             = "oidc"
      + realm                                   = (known after apply)
      + store_token                             = true
      + token_url                               = "https://sso-keycloak-c6af30-dev.apps.gold.devops.gov.bc.ca/auth/realms/bceidboth/protocol/openid-connect/token"
      + trust_email                             = false
      + ui_locales                              = false
      + user_info_url                           = "https://sso-keycloak-c6af30-dev.apps.gold.devops.gov.bc.ca/auth/realms/bceidboth/protocol/openid-connect/userinfo"
      + validate_signature                      = true
    }

  # module.keycloak_dev.module.onestopauth.keycloak_oidc_identity_provider.bceidbusiness will be created
  + resource "keycloak_oidc_identity_provider" "bceidbusiness" {
      + accepts_prompt_none_forward_from_client = false
      + add_read_token_role_on_create           = false
      + alias                                   = "bceidbusiness"
      + authenticate_by_default                 = false
      + authorization_url                       = "https://sso-keycloak-c6af30-dev.apps.gold.devops.gov.bc.ca/auth/realms/bceidbusiness/protocol/openid-connect/auth"
      + backchannel_supported                   = true
      + client_id                               = "onestopauth"
      + client_secret                           = (sensitive value)
      + default_scopes                          = "openid"
      + disable_user_info                       = false
      + display_name                            = "bceidbusiness"
      + enabled                                 = true
      + extra_config                            = {
          + "clientAuthMethod" = "client_secret_post"
        }
      + first_broker_login_flow_alias           = "first broker login"
      + hide_on_login_page                      = false
      + id                                      = (known after apply)
      + internal_id                             = (known after apply)
      + jwks_url                                = "https://sso-keycloak-c6af30-dev.apps.gold.devops.gov.bc.ca/auth/realms/bceidbusiness/protocol/openid-connect/certs"
      + link_only                               = false
      + provider_id                             = "oidc"
      + realm                                   = (known after apply)
      + store_token                             = true
      + token_url                               = "https://sso-keycloak-c6af30-dev.apps.gold.devops.gov.bc.ca/auth/realms/bceidbusiness/protocol/openid-connect/token"
      + trust_email                             = false
      + ui_locales                              = false
      + user_info_url                           = "https://sso-keycloak-c6af30-dev.apps.gold.devops.gov.bc.ca/auth/realms/bceidbusiness/protocol/openid-connect/userinfo"
      + validate_signature                      = true
    }

  # module.keycloak_dev.module.onestopauth.keycloak_oidc_identity_provider.idir will be created
  + resource "keycloak_oidc_identity_provider" "idir" {
      + accepts_prompt_none_forward_from_client = false
      + add_read_token_role_on_create           = false
      + alias                                   = "idir"
      + authenticate_by_default                 = false
      + authorization_url                       = "https://sso-keycloak-c6af30-dev.apps.gold.devops.gov.bc.ca/auth/realms/idir/protocol/openid-connect/auth"
      + backchannel_supported                   = true
      + client_id                               = "onestopauth"
      + client_secret                           = (sensitive value)
      + default_scopes                          = "openid"
      + disable_user_info                       = false
      + display_name                            = "idir"
      + enabled                                 = true
      + extra_config                            = {
          + "clientAuthMethod" = "client_secret_post"
        }
      + first_broker_login_flow_alias           = "first broker login"
      + hide_on_login_page                      = false
      + id                                      = (known after apply)
      + internal_id                             = (known after apply)
      + jwks_url                                = "https://sso-keycloak-c6af30-dev.apps.gold.devops.gov.bc.ca/auth/realms/idir/protocol/openid-connect/certs"
      + link_only                               = false
      + provider_id                             = "oidc"
      + realm                                   = (known after apply)
      + store_token                             = true
      + token_url                               = "https://sso-keycloak-c6af30-dev.apps.gold.devops.gov.bc.ca/auth/realms/idir/protocol/openid-connect/token"
      + trust_email                             = false
      + ui_locales                              = false
      + user_info_url                           = "https://sso-keycloak-c6af30-dev.apps.gold.devops.gov.bc.ca/auth/realms/idir/protocol/openid-connect/userinfo"
      + validate_signature                      = true
    }

  # module.keycloak_dev.module.onestopauth.keycloak_openid_client.test_client will be created
  + resource "keycloak_openid_client" "test_client" {
      + access_type                              = "PUBLIC"
      + backchannel_logout_session_required      = true
      + client_id                                = "test_client"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "test_client"
      + realm_id                                 = (known after apply)
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + use_refresh_tokens                       = true
      + valid_redirect_uris                      = [
          + "*",
        ]
      + web_origins                              = [
          + "*",
        ]

      + authentication_flow_binding_overrides {
          + browser_id = (known after apply)
        }
    }

  # module.keycloak_dev.module.onestopauth.keycloak_openid_client_scope.idp_client_scopes["azureidir"] will be created
  + resource "keycloak_openid_client_scope" "idp_client_scopes" {
      + description            = "azureidir idp client scope"
      + id                     = (known after apply)
      + include_in_token_scope = false
      + name                   = "azureidir"
      + realm_id               = (known after apply)
    }

  # module.keycloak_dev.module.onestopauth.keycloak_openid_client_scope.idp_client_scopes["bceidbasic"] will be created
  + resource "keycloak_openid_client_scope" "idp_client_scopes" {
      + description            = "bceidbasic idp client scope"
      + id                     = (known after apply)
      + include_in_token_scope = false
      + name                   = "bceidbasic"
      + realm_id               = (known after apply)
    }

  # module.keycloak_dev.module.onestopauth.keycloak_openid_client_scope.idp_client_scopes["bceidboth"] will be created
  + resource "keycloak_openid_client_scope" "idp_client_scopes" {
      + description            = "bceidboth idp client scope"
      + id                     = (known after apply)
      + include_in_token_scope = false
      + name                   = "bceidboth"
      + realm_id               = (known after apply)
    }

  # module.keycloak_dev.module.onestopauth.keycloak_openid_client_scope.idp_client_scopes["bceidbusiness"] will be created
  + resource "keycloak_openid_client_scope" "idp_client_scopes" {
      + description            = "bceidbusiness idp client scope"
      + id                     = (known after apply)
      + include_in_token_scope = false
      + name                   = "bceidbusiness"
      + realm_id               = (known after apply)
    }

  # module.keycloak_dev.module.onestopauth.keycloak_openid_client_scope.idp_client_scopes["idir"] will be created
  + resource "keycloak_openid_client_scope" "idp_client_scopes" {
      + description            = "idir idp client scope"
      + id                     = (known after apply)
      + include_in_token_scope = false
      + name                   = "idir"
      + realm_id               = (known after apply)
    }

  # module.keycloak_dev.module.onestopauth.keycloak_realm.this will be created
  + resource "keycloak_realm" "this" {
      + access_code_lifespan                     = "1m"
      + access_code_lifespan_login               = "30m"
      + access_code_lifespan_user_action         = "5m"
      + access_token_lifespan                    = "5m"
      + access_token_lifespan_for_implicit_flow  = "15m"
      + action_token_generated_by_admin_lifespan = "12h"
      + action_token_generated_by_user_lifespan  = "5m"
      + browser_flow                             = "browser"
      + client_authentication_flow               = "clients"
      + direct_grant_flow                        = "direct grant"
      + display_name                             = "Onestopauth"
      + display_name_html                        = "<b>Onestopauth</b>"
      + docker_authentication_flow               = "docker auth"
      + duplicate_emails_allowed                 = true
      + edit_username_allowed                    = (known after apply)
      + enabled                                  = true
      + id                                       = (known after apply)
      + internal_id                              = (known after apply)
      + login_theme                              = "bcgov-idp-stopper"
      + login_with_email_allowed                 = false
      + offline_session_idle_timeout             = "720h"
      + offline_session_max_lifespan             = (known after apply)
      + offline_session_max_lifespan_enabled     = false
      + realm                                    = "onestopauth"
      + refresh_token_max_reuse                  = 0
      + registration_allowed                     = (known after apply)
      + registration_email_as_username           = (known after apply)
      + registration_flow                        = "registration"
      + remember_me                              = (known after apply)
      + reset_credentials_flow                   = "reset credentials"
      + reset_password_allowed                   = (known after apply)
      + revoke_refresh_token                     = false
      + ssl_required                             = "external"
      + sso_session_idle_timeout                 = "30m"
      + sso_session_idle_timeout_remember_me     = (known after apply)
      + sso_session_max_lifespan                 = "10h"
      + sso_session_max_lifespan_remember_me     = (known after apply)
      + user_managed_access                      = false
      + verify_email                             = (known after apply)

      + otp_policy {
          + algorithm         = (known after apply)
          + digits            = (known after apply)
          + initial_counter   = (known after apply)
          + look_ahead_window = (known after apply)
          + period            = (known after apply)
          + type              = (known after apply)
        }

      + web_authn_passwordless_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }

      + web_authn_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }
    }

  # module.keycloak_dev.module.onestopauth.module.idp_auth_flow.keycloak_authentication_execution.exec1 will be created
  + resource "keycloak_authentication_execution" "exec1" {
      + authenticator     = "cookie-stopper"
      + id                = (known after apply)
      + parent_flow_alias = "idp stopper"
      + realm_id          = (known after apply)
      + requirement       = "ALTERNATIVE"
    }

  # module.keycloak_dev.module.onestopauth.module.idp_auth_flow.keycloak_authentication_execution.exec2 will be created
  + resource "keycloak_authentication_execution" "exec2" {
      + authenticator     = "identity-provider-stopper"
      + id                = (known after apply)
      + parent_flow_alias = "idp stopper"
      + realm_id          = (known after apply)
      + requirement       = "ALTERNATIVE"
    }

  # module.keycloak_dev.module.onestopauth.module.idp_auth_flow.keycloak_authentication_execution.exec3 will be created
  + resource "keycloak_authentication_execution" "exec3" {
      + authenticator     = "identity-provider-stop-form"
      + id                = (known after apply)
      + parent_flow_alias = "idp stopper"
      + realm_id          = (known after apply)
      + requirement       = "ALTERNATIVE"
    }

  # module.keycloak_dev.module.onestopauth.module.idp_auth_flow.keycloak_authentication_flow.flow will be created
  + resource "keycloak_authentication_flow" "flow" {
      + alias       = "idp stopper"
      + id          = (known after apply)
      + provider_id = "basic-flow"
      + realm_id    = (known after apply)
    }

Plan: 98 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 98 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junminahn, Action: `pull_request`*